---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotHaveIndependentOverlappingGrids
source: html/3f02ab20-256e-31e8-f283-fba52ae70e53.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotHaveIndependentOverlappingGrids Property

Overlapping independent type associated gridlines are not allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotHaveIndependentOverlappingGrids { get; }
```